{
  "architectures": [
    "CamembertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 5,
  "classifier_dropout": null,
  "dtype": "float32",
  "eos_token_id": 6,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "Emo",
    "1": "Comportementale",
    "2": "Designee",
    "3": "Montree",
    "4": "Suggeree",
    "5": "Base",
    "6": "Complexe",
    "7": "Admiration",
    "8": "Autre",
    "9": "Colere",
    "10": "Culpabilite",
    "11": "Degout",
    "12": "Embarras",
    "13": "Fierte",
    "14": "Jalousie",
    "15": "Joie",
    "16": "Peur",
    "17": "Surprise",
    "18": "Tristesse"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "Admiration": 7,
    "Autre": 8,
    "Base": 5,
    "Colere": 9,
    "Complexe": 6,
    "Comportementale": 1,
    "Culpabilite": 10,
    "Degout": 11,
    "Designee": 2,
    "Embarras": 12,
    "Emo": 0,
    "Fierte": 13,
    "Jalousie": 14,
    "Joie": 15,
    "Montree": 3,
    "Peur": 16,
    "Suggeree": 4,
    "Surprise": 17,
    "Tristesse": 18
  },
  "layer_norm_eps": 1e-05,
  "max_position_embeddings": 514,
  "model_type": "camembert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "output_past": true,
  "pad_token_id": 1,
  "position_embedding_type": "absolute",
  "problem_type": "multi_label_classification",
  "transformers_version": "4.57.6",
  "type_vocab_size": 1,
  "use_cache": true,
  "vocab_size": 32005
}
